iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/гисПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисПоказатели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.гисПоказателиТипы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникВладелецЗначений</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗнаков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.гисПоказателиПериодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СлоиКарты</name>
    <attributes>
      <name>СлойКарты</name>
      <type>
        <types>CatalogRef.гисСлоиКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсплывающееСообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Детализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветаПоказателей</name>
    <attributes>
      <name>КлючСтрокиСлоиКарты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисПоказателиТипы/гисПоказателиТипы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисПоказателиТипы</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЭтоГруппа Тогда
		Если ТипЗначения = Перечисления.гисПоказателиТипы.Справочник Тогда
			ПроверяемыеРеквизиты.Добавить("СправочникИмя");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ЭтоЧисло = ТипЗначения = Перечисления.гисПоказателиТипы.Число;
	
	Для Каждого Строка Из ЦветаПоказателей Цикл
		Если ЗначениеЗаполнено(Строка.Подпись) Тогда
			Продолжить;
		КонецЕсли;
			
		Если ЭтоЧисло Тогда
			Строка.Подпись = "от " + Строка.ЗначениеОт + " до " + Строка.ЗначениеДо;
		Иначе
			Строка.Подпись = Строка(Строка.ЗначениеОт);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
